---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.CentroidVertical
source: html/d1646583-980a-d69a-60a0-4b3b23c14c94.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.CentroidVertical Property

Distance from centroid to the upper extremites along vertical axis.

## Syntax (C#)
```csharp
public double CentroidVertical { get; set; }
```